[{
	"_id": {
		"$oid": "5faee27c54a4d7fdb32bd085"
	},
	"name": "Joshua Steinberg Beaumont Ceramic Collection - Bowl, Stand and Spoons Set (Ships by 1/7)",
	"description": "Beautifully crafted with an understated yet classic design, Joshua Steinberg’s Beaumont Ceramic Collection features a range of elegant stoneware that will raise the standards of cosmopolitan living to a new level. This ceramic bowl and acacia wooden stand and spoon set reflect a contemporary aesthetic which will also prove timeless.",
	"imageUrl": "/uploads/bowl-bowl-stand-1605341279065.jpg",
	"biddingCloseAt": {
		"$date": "2020-11-26T19:29:34Z"
	},
	"biddings": [],
	"__v": 53,
	"autoBidders": []
},
{
	"_id": {
		"$oid": "5faee32054a4d7fdb32bd086"
	},
	"name": "Palmero Caron Skeleton Automatic Watch - Black Dial and Black Strap (Ships by 1/30) - updated",
	"description": "Pushing the boundaries of refinement and engineering in the art of watchmaking, Palmero present their Caron Skeleton Automatic Watch collection, crafted in stainless steel and named after Master Watchmaker and inventor of the skeleton watch André-Charles Caron. The result of combined expertise by Palmero’s skilled team of craftsman, the Palmero Caron Skeleton Automatic Watch pays homage to the watchmaker's traditional art and features a fully automatic movement, with the mechanics in full view thanks to the skeleton dial. With a glass case-back, the skeletonised components are also visible from the back of the watch, making it all the more exceptional a timepiece. Over time, the genuine leather strap will develop a unique patina, which only adds to the striking nature of this handsome watch.",
	"imageUrl": "/uploads/watch-1605342870541.jpg",
	"biddingCloseAt": {
		"$date": "2020-11-25T11:30:00Z"
	},
	"biddings": [],
	"__v": 3
},
{
	"_id": {
		"$oid": "5faee44a54a4d7fdb32bd087"
	},
	"name": "Bolvaint - The Estelle Bag",
	"description": "The structured streamlined shape of the Bolvaint Estelle Bag, a must-have for the winter season, is beautifully in keeping with its timeless black and brown palette. Designed to effortlessly accessorise the most stylish of outfits, the polished gold hardware pairs exquisitely with statement jewellery while the white embroidered accents provide the final touches. An elegant look when carried in-hand, it also comes with a convenient shoulder strap for when you’re on the move.",
	"imageUrl": "/uploads/hand-bag-1605297226129.jpg",
	"biddingCloseAt": {
		"$date": "2020-11-15T11:30:00Z"
	},
	"biddings": [],
	"__v": 1
},
{
	"_id": {
		"$oid": "5faee46f54a4d7fdb32bd088"
	},
	"name": "BAHIA Sarita Block Heeled Strappy Sandals in tan, size 10",
	"description": "Bahia’s Sarita strappy sandals will prove essential additions to a stylish wardrobe. Available in a choice of tan or black, these exceptionally chic sandals feature crisscrossing straps with a unique circular motif and are a fail-safe option for relaxed day-time dressing that can be transferred effortlessly into evening-wear. Made in faux leather in line with Bahia’s sustainable policy, the Sarita sandals are set on a leg-lengthening heel with a chunky platform to keep you grounded at all times. Wear them with a 60’s-inspired mini dress or floor-sweeping hems alike.",
	"imageUrl": "/uploads/women-sandal-1605297263865.jpg",
	"biddingCloseAt": {
		"$date": "2020-11-29T19:53:47Z"
	},
	"biddings": [],
	"__v": 15
},
{
	"_id": {
		"$oid": "5faee49654a4d7fdb32bd089"
	},
	"name": "Ashlynn Avenue - Solare 18K Yellow Gold-Plated Ring with Pavé Gemstones 0.93 Ctw - Size 7",
	"description": "Presenting The Anniversary Collection by Ashlynn Avenue. A timeless compilation of classic pieces for that special woman in your life – the perfect way to show how much you care, love and cherish her. Each piece is carefully crafted to reflect a sense of refined elegance, embodying an enduring quality so she can treasure it for years to come. The Solare 18K Yellow Gold-Plated Ring with thirty-one gemstones has a total weight of 0.93 Ctw. The gorgeous pavé design highlights the clarity and sparkle of each round-cut gemstone, while the surrounding yellow gold-plated band showcases a class and style redolent of the great Audrey Hepburn. The very classic nature of this beautiful eternity ring easily complements any existing wedding band or engagement ring.",
	"imageUrl": "/uploads/ring-1605297302081.jpg",
	"biddingCloseAt": {
		"$date": "2020-11-18T19:54:25Z"
	},
	"biddings": [],
	"__v": 3
},
{
	"_id": {
		"$oid": "5faee4bc54a4d7fdb32bd08a"
	},
	"name": "Palmero Electra Earrings",
	"description": "A playful take on the classic hoop, the Palmero Electra Earrings evoke the whimsical nature of the mythological Goddess from which they draw their inspiration. With their vibrant range of colour beautifully accented by tones of gold and crafted with a blend of allow, brass and glass, their chic yet spirited nature will appeal to the discerning jewellery-lover searching for a bold yet elegant look.",
	"imageUrl": "/uploads/ear-ring-1605297340167.jpg",
	"biddingCloseAt": {
		"$date": "2020-12-30T17:30:00Z"
	},
	"biddings": [],
	"__v": 15,
	"autoBidders": []
},
{
	"_id": {
		"$oid": "5faee4da54a4d7fdb32bd08b"
	},
	"name": "Nelly Valor 18k Rose Gold Plated Swarovski Pave Necklace by Cate & Chloe",
	"description": "The Nelly necklace is effortlessly breathtaking as it is statement making and will be the perfect addition to your jewelry collection! The Nelly features a 18k rose gold plated design with an array of round cut Swarovski stones set in the middle that adds the perfect finishing touch to your evening outfit. Pair with the Nelly earrings for a trending new look this season.",
	"imageUrl": "/uploads/necklace-1605297370503.jpg",
	"biddingCloseAt": {
		"$date": "2020-12-31T19:55:42Z"
	},
	"biddings": [],
	"__v": 5,
	"autoBidders": []
},
{
	"_id": {
		"$oid": "5faee50354a4d7fdb32bd08c"
	},
	"name": "Bolvaint Aeris Lambskin Moto Jacket – Women’s 2XL",
	"description": "Crafted from soft, supple lambskin, the Aeris is a distinctively constructed cropped jacket with three pockets, an asymmetrical zip-front and quilted upper sleeves. Designed to get suppler with wear and use, the dark black of the lambskin is set against polished gunmetal hardware in the form of zips and bottom snaps. Combining feminine sophistication with traditional moto design, the Aeris is a versatile piece, perfect for transitional dressing.",
	"imageUrl": "/uploads/women-jacket-1605297411071.jpg",
	"biddingCloseAt": {
		"$date": "2020-11-28T07:17:00Z"
	},
	"biddings": [],
	"__v": 2100,
	"autoBidders": []
},
{
	"_id": {
		"$oid": "5faee51b54a4d7fdb32bd08d"
	},
	"name": "Bolvaint Arduin Lambskin Motoring Jacket – Men’s, XL",
	"description": "A classic motoring jacket in soft, indulgent lambskin. The Arduin is distinguished by its signature details – the collar and front pockets carry the Bolvaint motif against polished gunmetal, while a contoured over-stitch on the jacket-front and sleeves creates a superb streamlined silhouette. A center front zipper, traditional band collar and double buttoned cuff complement the excellent tannage and sumptuous texture of Arduin’s top-grain lambskin. This motoring jacket is rich in subtle detail. Pairs well with everything from classic denims to tailored separates.",
	"imageUrl": "/uploads/men-jacket-1605297435719.jpg",
	"biddingCloseAt": {
		"$date": "2021-01-20T19:56:52Z"
	},
	"biddings": [],
	"__v": 358,
	"autoBidders": []
},
{
	"_id": {
		"$oid": "5faee57554a4d7fdb32bd08e"
	},
	"name": "Linda Farrow Novelty Sunglasses - Matte Shell Grey / Lavender Snake Purple",
	"description": "Linda Farrow sunglasses are luxurious designer frames that stand the test of time. The epitome of opulence, these shades elevate your style from casual to high-fashion.",
	"imageUrl": "/uploads/glasses-1605297525303.jpg",
	"biddingCloseAt": {
		"$date": "2020-11-20T19:57:17Z"
	},
	"biddings": [],
	"__v": 0
},
{
	"_id": {
		"$oid": "5faee58c54a4d7fdb32bd08f"
	},
	"name": "Alfred Dunhill Outerwear Navy Trench Coat - Mens - Large",
	"description": "Dunhill is design driven, with style, substance and purpose; engineering unique and stylish luxuries for men. Founded in 1893 when Alfred Dunhill took over his father’s harness manufacturing business, Alfred developed and invented products for the emerging motoring industry to meet the needs of a new generation. Leather and Craftsmanship is as integral today, as it was 125 years ago. In the leather workshops in London’s Walthamstow and in Italy, Dunhill upholds the tradition of considered craft.",
	"imageUrl": "/uploads/coat-1605297548205.jpeg",
	"biddingCloseAt": {
		"$date": "2020-12-01T20:02:00Z"
	},
	"biddings": [],
	"__v": 2
},
{
	"_id": {
		"$oid": "5faee5a654a4d7fdb32bd090"
	},
	"name": "Schultz ZycraPulse Zero Gravity Massage Chair",
	"description": "Discover the real health benefits of a massage in a ‘zero gravity’ environment with the Schultz ZycraPulse Zero Gravity Massage Chair. With the click of a switch, you’ll be transported into a ‘neutral body position’ with your feet slightly elevated above your head, instantly giving you a relaxed floating feeling. Combined with your choice of fully automated or adjustable massage modes, you’ll enjoy a level of relaxation unlike any you’ve experienced before",
	"imageUrl": "/uploads/message-chair-1605297574163.jpg",
	"biddingCloseAt": {
		"$date": "2020-11-22T19:59:11Z"
	},
	"biddings": [],
	"__v": 0
},
{
	"_id": {
		"$oid": "5faeeb9c505728010d6be765"
	},
	"name": "Thaynards - Barry The Hug-Loving Bear",
	"description": "Whether it’s play time, sleep time or cuddle time, every child deserves a special friend they can count on to make them feel safe and happy. And Barry the Hug-loving Bear more than delivers on that front, offering your child the perfect combination of security and fun.",
	"imageUrl": "/uploads/teddy-bear-1605299100316.jpg",
	"biddingCloseAt": {
		"$date": "2020-11-30T20:16:47Z"
	},
	"biddings": [],
	"__v": 2
},
{
	"_id": {
		"$oid": "5faeebb2505728010d6be766"
	},
	"name": "Schultz HS20 Hybrid SoundWave In-Ear Wire Earphones",
	"description": "Designed specifically with audio professionals in mind, the Schultz HS20 Hybrid SoundWave In-Ear Wire Earphones use the very latest in hybrid technology to deliver a crystal clear defined sound for use in the studio. The in-ear monitors feature an outstanding frequency response range of 10-40000Hz, ensuring the clarity of every decibel is of the highest standards. The design of the monitors ensure a professional-grade fit within the ear that allows for the very best in sound isolation, ensuring any background noise is minimised.",
	"imageUrl": "/uploads/ear-phone-1605299122633.jpg",
	"biddingCloseAt": {
		"$date": "2021-01-12T20:25:02Z"
	},
	"biddings": [],
	"__v": 1
},
{
	"_id": {
		"$oid": "5faeebc9505728010d6be767"
	},
	"name": "Sony a6400 Mirrorless APS-C Interchangeable-Lens Camera with 16-50mm lens",
	"description": "Stable, fast, versatile, and compact, the Alpha a6400 from Sony is an APS-C-format mirrorless camera that adopts many of the features normally reserved for their full-frame lineup. This includes an autofocus acquisition of 0.02 seconds, Real-time Eye AF and Real-time Tracking capabilities, high-speed shooting up to 11 fps and silent shooting up to 8 fps, both with AF/AE tracking, an upgraded BIONZ X image processing engine, a fully tiltable 180° LCD touchscreen, UHD 4K movie recording with full pixel readout and no pixel binning, internal recording for time-lapse videos, and more.",
	"imageUrl": "/uploads/camera-1605299145405.jpg",
	"biddingCloseAt": {
		"$date": "2021-01-29T20:25:23Z"
	},
	"biddings": [],
	"__v": 0
},
{
	"_id": {
		"$oid": "5faeebde505728010d6be768"
	},
	"name": "180 Pairs! Velvet Heart® Anklet Peek-A-Boo Socks - Womens - Tan, Navy Blue & Gray",
	"description": "Hide & seek with a touch of flare! Stylish socks in tan, navy blue & gray have a lace detailing leaving some skin to show behind!",
	"imageUrl": "/uploads/socks-1605299166939.jpg",
	"biddingCloseAt": {
		"$date": "2021-01-16T20:22:00Z"
	},
	"biddings": [],
	"__v": 2
},
{
	"_id": {
		"$oid": "5faeebf5505728010d6be769"
	},
	"name": "Adamant - X-Core Waterproof Dry Bag Backpack - Blue",
	"description": "From city streets to backwoods trails, the Adamant X-Core Waterproof Dry Bag Backpack really goes the distance. If you can dish it out, this bag can take it. Made of rugged 500D PVC Tarpaulin, it’s completely waterproof so your gear stays dry through rain, wind, sleet and snow. Heat-seal seam construction means you can set this heavy-duty bag in a puddle all day long and the water will never get in. Featuring two side durable clip-shut closures, adjustable padded shoulder straps and an interlocking chest strap so it stays put no matter how rugged your terrain. With an outer 7.5-inch zip pocket and convenient carry handle, this vibrant backpack is just what you need – whether you're toting it around campus in a downpour or hitting the trails in a deluge. Just load it up with all your essentials and you’re good to go. Because you live life on your terms and aren’t going to let a little inclement weather stand in your way.",
	"imageUrl": "/uploads/back-pack-1605299189209.jpg",
	"biddingCloseAt": {
		"$date": "2021-03-17T20:26:08Z"
	},
	"biddings": [],
	"__v": 12
},
{
	"_id": {
		"$oid": "5faeec1a505728010d6be76a"
	},
	"name": "Microsoft Surface Go 2 10.5-in Tablet - 4GB 64GB - Platinum",
	"description": "Your perfect everyday companion. New 10.5\" Surface Go 2 is perfect for keeping up and winding down - delivering tablet portability with laptop versatility, long battery life, a stunning touchscreen, and Windows security for the whole family. Browse, shop, and manage email with ease, relax with your favorite TV shows, and much more.",
	"imageUrl": "/uploads/tablet-1605299226278.jpg",
	"biddingCloseAt": {
		"$date": "2020-12-17T20:26:30Z"
	},
	"biddings": [],
	"__v": 2,
	"autoBidders": []
},
{
	"_id": {
		"$oid": "5faf58658a371b11fcd6457c"
	},
	"name": "Sun Joe SPX3000 Pressure Joe Electric Pressure Washer",
	"description": "The Pressure Joe SPX3000 electric pressure washer delivers it all to tackle a variety of cleaning tasks: homes, buildings, RV’s, cars, trucks, boats, decks, driveways, patios, lawn equipment and more. Packed with an 1800-Watt/14.5-amp motor, the Pressure Joe SPX 3000 generates up to 2030 PSI of water pressure and 1.76 GPM of water flow for maximum cleaning power. Remove tar and grease from concrete, heavy mildew stains, oil stains, rust from steel, caked mud on equipment, and other stubborn gunk and grime.",
	"imageUrl": "/uploads/pressure-washer-1605326949056.jpg",
	"biddingCloseAt": {
		"$date": "2020-11-14T05:30:00Z"
	},
	"biddings": [],
	"__v": 1
},
{
	"_id": {
		"$oid": "5faf589f8a371b11fcd6457d"
	},
	"name": "Samsung Galaxy 13.3\" Book Flex 512GB Storage Laptop, Royal Blue",
	"description": "This revolutionary 2-in-1 PC will defy your expectations of computing. The Samsung Galaxy Book Flex features a vivid QLED display packed with lifelike detail and stunning colors, combined with an ultra-slim, convertible design. A formidable 10th gen Intel® Core™ processor delivers split-second responsiveness, and the Wireless PowerShare turns your trackpad into a charger¹. With up to 19 hours of battery life, you can keep working and creating throughout the day and into the night. Plus, the included Bluetooth-enabled S Pen lets you control presentations and content even from across the room.",
	"imageUrl": "/uploads/laptop-1605327007771.jpg",
	"biddingCloseAt": {
		"$date": "2020-11-15T04:09:10Z"
	},
	"biddings": [],
	"__v": 0
},
{
	"_id": {
		"$oid": "5fbf4b442737f12f3c378868"
	},
	"name": "2012 Two Door Red Fiat 500L",
	"description": "Maker; Fiat. Color; red. Year; 2012. Model;  500L. Approximately 45,000 miles. Single  owner, no accidents and always garaged.  Buyer's premium on this lot is 10% by phone  or absentee bid with cash / check via the gallery at 203 355 9335 and 15% for all  online bidding venues with cash / check.  Credit card fees can be added.",
	"imageUrl": "/uploads/93635311_1_x-1606372164868.jpg",
	"biddingCloseAt": {
		"$date": "2020-11-27T06:29:11Z"
	},
	"biddings": [],
	"__v": 2
},
{
	"_id": {
		"$oid": "5fc0c2ef1274db48480a91ba"
	},
	"name": "PELÉ AND MARADONA SIGNED JERSEYS DISPLAY",
	"description": "A framed display featuring jerseys signed by famous World Cup winners  Framed, 59 by 35 inches",
	"imageUrl": "/uploads/93391455_1_x-1606468335321.jpg",
	"biddingCloseAt": {
		"$date": "2020-11-27T09:15:00Z"
	},
	"biddings": [],
	"__v": 3
},
{
	"_id": {
		"$oid": "5fc1fbe1bebe501d849c84d5"
	},
	"autoBidders": [
		{
			"$oid": "5fc0e7882772a54a64db639c"
		}
	],
	"name": "A FAMILLE ROSE ‘BUTTERFLY’ VASE",
	"description": "A FAMILLE ROSE ‘BUTTERFLY’ VASE GUANGXU SIX-CHARACTER MARK IN IRON RED AND OF THE PERIOD (1875-1908) Decorated overall with a multitude of butterflies separated by a gilt-bordered band of lotus sprays and gilt xi characters on the shoulder. 15 1/2 in. (39.4 cm.) high",
	"imageUrl": "/uploads/93521662_1_x-1606548449791.jpg",
	"biddingCloseAt": {
		"$date": "2020-11-28T07:29:00Z"
	},
	"biddings": [],
	"__v": 224
}]

